---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalBumpMap
source: html/650f5cff-63a9-d2b9-4f3a-cc98fb15a400.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalBumpMap Property

An external resource type representing Decal linked data for bump map.
 This type is reserved for future expansion but not yet implemented.

## Syntax (C#)
```csharp
public static ExternalResourceType DecalBumpMap { get; }
```